Autodesk.Revit.DB.Electrical.ElectricalSystem.SelectPanel(Autodesk.Revit.DB.FamilyInstance)
Set the panel for the Electrical System.
Remarks:
If successful, the panel will be set for the system. Otherwise the exception will be thrown.
This method will only function with the Autodesk Revit MEP application.
panel:
The panel of the electrical system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The panel does not have enough slots and Feed Through Lugs is unchecked or already in use.
-or-
Thrown when the panel cannot be set for the electrical system.
Since:
2011